In [1]:
#pip install ipython-sql 1)Load the Extension, 2)Check SQL Cell
%load_ext sql
%sql sqlite://
#%reload_ext sql

Create Employees Table:

In [2]:
%%sql
DROP TABLE IF EXISTS Employees;


CREATE TABLE Employees (
    EmployeeID INT ,
    FirstName VARCHAR(255),
    LastName VARCHAR(255),
    Salary INT,
    CreditDate DATE
);

 * sqlite://
Done.
Done.

[]

Insert Sample Data into Employees Table:

In [3]:
%%sql
INSERT INTO Employees (EmployeeID, FirstName, LastName, Salary, CreditDate)
VALUES (1, 'John', 'Doe', 50000,'2023-06-01'),
       (2, 'Alice', 'Smith', 60000,'2023-06-20'),
       (3, 'Bob', 'Johnson', 55000,'2023-07-01'),
       (3, 'Bob', 'Johnson', 55000,'2023-07-01'),
       (5, 'Eva', 'Brown', 65000,'2023-08-01'),
       (6, 'Mike', 'Wilson', 70000,'2023-08-05');

 * sqlite://
6 rows affected.

[]

In [8]:
%%sql
SELECT *
FROM Employees;

 * sqlite://
Done.

[(1, 'John', 'Doe', 50000, '2023-06-01'),
 (2, 'Alice', 'Smith', 60000, '2023-06-20'),
 (3, 'Bob', 'Johnson', 55000, '2023-07-01'),
 (3, 'Bob', 'Johnson', 55000, '2023-07-01'),
 (5, 'Eva', 'Brown', 65000, '2023-08-01'),
 (6, 'Mike', 'Wilson', 70000, '2023-08-05')]

# 1.Find the 3th Highest Salary:

Using Limit and Offset

In [10]:
%%sql

SELECT DISTINCT Salary
FROM Employees
ORDER BY Salary DESC
LIMIT 1 OFFSET 3 - 1;

 * sqlite://
Done.

[(60000,)]

Using ORDER BY

In [11]:
%%sql

SELECT Salary
FROM Employees
WHERE Salary IN (SELECT Salary FROM Employees ORDER BY Salary DESC LIMIT 3)
ORDER BY Salary ASC
LIMIT 1;

 * sqlite://
Done.

[(60000,)]

Using Window function

In [12]:
%%sql

WITH RankedSalaries AS (
    SELECT Salary, 
           RANK() OVER (ORDER BY Salary DESC) AS RankOfTheSalary
    FROM Employees
)
SELECT Salary
FROM RankedSalaries
WHERE RankOfTheSalary = 3;

 * sqlite://
Done.

[(60000,)]

# 2.Find Duplicate Rows:

In [13]:
%%sql
SELECT EmployeeID, COUNT(*)
FROM Employees
GROUP BY EmployeeID
HAVING COUNT(*) > 1;

 * sqlite://
Done.

[(3, 2)]

In [14]:
# Remove Duplicate Rows:

%%sql

DELETE FROM Employees
WHERE EmployeeID IN (
    SELECT EmployeeID
    FROM Employees
    GROUP BY EmployeeID
    HAVING COUNT(*) > 1
    LIMIT 1
);

In [17]:
%%sql
SELECT * 
FROM Employees;

 * sqlite://
Done.

[(1, 'John', 'Doe', 50000, '2023-06-01'),
 (2, 'Alice', 'Smith', 60000, '2023-06-20'),
 (5, 'Eva', 'Brown', 65000, '2023-08-01'),
 (6, 'Mike', 'Wilson', 70000, '2023-08-05')]

# 3.Calculate Cumulative Sum:

In [11]:
%%sql

SELECT EmployeeID, Salary, 
       SUM(Salary) OVER (ORDER BY EmployeeID) AS CumulativeSum
FROM Employees;

 * sqlite://
Done.

[(1, 50000, 50000), (2, 60000, 110000), (5, 65000, 175000), (6, 70000, 245000)]